Vimalananth/STM32-EC200-Firmware/src/modem.c
static void queue_publish(const char *topic, const char *payload)
{
    if (pub_pending)
        return; /* drop if previous not sent yet      */

    strncpy(pub_topic, topic, sizeof(pub_topic) - 1);
    strncpy(pub_payload, payload, sizeof(pub_payload) - 1);
    pub_topic[sizeof(pub_topic) - 1] = '\0';
    pub_payload[sizeof(pub_payload) - 1] = '\0';
    pub_pending = true;
}

/* Format float to 1 decimal place without requiring -u_printf_float.
 * Handles negative values and clamps out-of-range to "0.0".           */
static void fmt_f1(char *out, int sz, float v)
{
    if (v != v || v > 99999.0f || v < -9999.0f) { snprintf(out, sz, "0.0"); return; }
    int neg = (v < 0.0f);
    float a = neg ? -v : v;
    int   w = (int)a;
    int   d = (int)((a - (float)w) * 10.0f);
    if (neg) snprintf(out, sz, "-%d.%d",  w, d);
    else     snprintf(out, sz,  "%d.%d",  w, d);
}

static void fmt_f2(char *out, int sz, float v)
{
    if (v != v || v > 9999.0f || v < -999.0f) { snprintf(out, sz, "0.00"); return; }
    int neg = (v < 0.0f);
    float a = neg ? -v : v;
    int   w = (int)a;
    int   d = (int)((a - (float)w) * 100.0f);
    if (neg) snprintf(out, sz, "-%d.%02d", w, d);
    else     snprintf(out, sz,  "%d.%02d", w, d);
}

static void publish_status(void)
{
    float v1 = Sensor_ReadVoltagePhase1();
    float v2 = Sensor_ReadVoltagePhase2();
    float v3 = Sensor_ReadVoltagePhase3();
    float i  = Sensor_ReadCurrentACS712();

    char sv1[12], sv2[12], sv3[12], sci[12];
    fmt_f1(sv1, sizeof(sv1), v1);
    fmt_f1(sv2, sizeof(sv2), v2);
    fmt_f1(sv3, sizeof(sv3), v3);
    fmt_f2(sci, sizeof(sci), i);

    char scfg_ov[10], scfg_uv[10], scfg_pl[10], scfg_dry_i[10];
    fmt_f1(scfg_ov,    sizeof(scfg_ov),    cfg_ov);
    fmt_f1(scfg_uv,    sizeof(scfg_uv),    cfg_uv);
    fmt_f1(scfg_pl,    sizeof(scfg_pl),    cfg_pl);
    fmt_f2(scfg_dry_i, sizeof(scfg_dry_i), cfg_dry_i);

    char payload[420];
    snprintf(payload, sizeof(payload),
             "{\"relay1_state\":%d,\"relay2_state\":%d,"
             "\"v1\":%s,\"v2\":%s,\"v3\":%s,"
             "\"current\":%s,"
             "\"dry_run\":%s,\"online\":true,"
             "\"mb_ok\":%d,\"mb_rx\":%d,\"rssi\":%d,\"boot_phase\":%u,"
             "\"fw\":\"%s\","
             "\"cfg_ov\":%s,\"cfg_uv\":%s,\"cfg_pl\":%s,"
             "\"cfg_dry_i\":%s,\"cfg_dry_t\":%d}",
             relay1 ? 1 : 0,
             relay2 ? 1 : 0,
             sv1, sv2, sv3, sci,
             dry_run_tripped ? "true" : "false",
             Modbus_IsDataValid() ? 1 : 0,
             (int)Modbus_GetLastRx(),
             (int)last_rssi,
             (unsigned)g_boot_phase,
             g_fw_ver,
             scfg_ov, scfg_uv, scfg_pl, scfg_dry_i, cfg_dry_t);

    queue_publish(TOPIC_STATUS, payload);
}

static void publish_alert(bool ov, bool uv, bool pl, bool dr)
{
    char payload[128];
    snprintf(payload, sizeof(payload),
             "{\"overvoltage\":%s,\"undervoltage\":%s,"
             "\"phase_loss\":%s,\"dry_run_trip\":%s}",
             ov ? "true" : "false",
             uv ? "true" : "false",
             pl ? "true" : "false",
             dr ? "true" : "false");

    queue_publish(TOPIC_ALERTS, payload);
}

/* ═══════════════════════════════════════════════════════════════════════════
 * Protection logic  — called every 1 s when connected
 * ═══════════════════════════════════════════════════════════════════════════ */

static void run_protection(void)
{
    float v1 = Sensor_ReadVoltagePhase1();
    float v2 = Sensor_ReadVoltagePhase2();
    float v3 = Sensor_ReadVoltagePhase3();
    float i = Sensor_ReadCurrentACS712();

    bool ov = (v1 > cfg_ov || v2 > cfg_ov || v3 > cfg_ov);
    bool uv = (v1 < cfg_uv || v2 < cfg_uv || v3 < cfg_uv);
    bool pl = (v1 < cfg_pl || v2 < cfg_pl || v3 < cfg_pl);

    /* voltage protection disabled until meter wiring verified
    if ((ov || uv || pl) && relay1)
    {
        Relay1_Set(false);
        Relay2_Set(true);
        publish_alert(ov, uv, pl, false);
        Debug_Print("[PROT] Voltage fault — pump OFF\r\n");
        return;
    } */

    /* dry run detection disabled until current sensor wiring verified
    if (relay1 && !dry_run_tripped)
    {
        if (i < cfg_dry_i)
        {
            dry_run_count++;
            if (dry_run_count >= (uint8_t)cfg_dry_t)
            {
                dry_run_tripped = true;
                lockout_until = HAL_GetTick() + LOCKOUT_MS;
                Relay1_Set(false);
                Relay2_Set(true);
                publish_alert(false, false, false, true);
                Debug_Print("[PROT] Dry run — pump OFF + lockout\r\n");
            }
        }
        else
        {
            dry_run_count = 0;
        }
    }

    if (dry_run_tripped && HAL_GetTick() >= lockout_until)
    {
        dry_run_tripped = false;
        dry_run_count = 0;
        Relay2_Set(false);
        publish_alert(false, false, false, false);
        Debug_Print("[PROT] Lockout cleared\r\n");
    } */
}

/* ═══════════════════════════════════════════════════════════════════════════
 * JSON field extractor  — extracts integer value for a key
 * e.g. extract_int("{\"relay1\":1,\"relay2\":0}", "relay1") → 1
 * ═══════════════════════════════════════════════════════════════════════════ */

static int extract_int(const char *json, const char *key)
{
    char search[32];
    snprintf(search, sizeof(search), "\"%s\":", key);
    const char *p = strstr(json, search);
    if (!p)
        return -1;
    p += strlen(search);
    while (*p == ' ')
        p++;
    return atoi(p);
}

/* ═══════════════════════════════════════════════════════════════════════════
 * JSON float field extractor — returns float value for key, or def if missing
 * ═══════════════════════════════════════════════════════════════════════════ */

/* Lightweight float parser — avoids newlib strtod() bloat (~15 KB).
 * Handles formats like "1.5", "480", "-2.3". */
static float parse_float_lite(const char *s)
{
    while (*s == ' ') s++;
    float sign = 1.0f;
    if (*s == '-') { sign = -1.0f; s++; }
    float result = 0.0f;
    while (*s >= '0' && *s <= '9') { result = result * 10.0f + (*s++ - '0'); }
    if (*s == '.') {
        s++;
        float frac = 0.1f;
        while (*s >= '0' && *s <= '9') { result += (*s++ - '0') * frac; frac *= 0.1f; }
    }
    return sign * result;
}

static float extract_float(const char *json, const char *key, float def)
{
    char search[32];
    snprintf(search, sizeof(search), "\"%s\":", key);
    const char *p = strstr(json, search);
    if (!p) return def;
    p += strlen(search);
    while (*p == ' ') p++;
    return parse_float_lite(p);
}

/* ═══════════════════════════════════════════════════════════════════════════
 * JSON string field extractor — copies value of "key":"<value>" into out
 * Returns true if key was found and value is non-empty.
 * ═══════════════════════════════════════════════════════════════════════════ */

