Vimalananth/STM32-EC200-Firmware/src/modem.c
static bool extract_str(const char *json, const char *key, char *out, size_t max)
{
    char search[40];
    snprintf(search, sizeof(search), "\"%s\":\"", key);
    const char *p = strstr(json, search);
    if (!p) return false;
    p += strlen(search);
    size_t i = 0;
    while (*p && *p != '"' && i < max - 1)
        out[i++] = *p++;
    out[i] = '\0';
    return (i > 0);
}

/* Accept OTA trigger payloads in either format:
 *   {"url":"https://..."}   or   https://...
 * Extract URL from any line containing http/https text. */
static bool extract_ota_url_any(const char *text, char *out, size_t max)
{
    const char *p = strstr(text, "https://");
    if (!p) p = strstr(text, "http://");
    if (!p) return false;

    size_t i = 0;
    while (*p && i < max - 1) {
        char c = *p;
        if (c == '"' || c == ',' || c == ' ' || c == '\r' || c == '\n')
            break;
        out[i++] = c;
        p++;
    }
    out[i] = '\0';
    return (i > 0);
}

static void modem_ota_start(const char *url); /* forward declaration */
static void modem_ota_publish(const char *topic, const char *payload); /* forward declaration */
static bool modem_is_exact_reboot_urc(const char *line);

/* Apply protection settings from JSON payload */
static void apply_settings(const char *json)
{
    float v;
    int   t;
    v = extract_float(json, "ov",    cfg_ov);    if (v > 0.0f) cfg_ov    = v;
    v = extract_float(json, "uv",    cfg_uv);    if (v > 0.0f) cfg_uv    = v;
    v = extract_float(json, "pl",    cfg_pl);    if (v > 0.0f) cfg_pl    = v;
    v = extract_float(json, "dry_i", cfg_dry_i); if (v > 0.0f) cfg_dry_i = v;
    t = extract_int(json, "dry_t");              if (t > 0)    cfg_dry_t = t;
    Debug_Print("[CFG] Settings updated\r\n");
}

/* ═══════════════════════════════════════════════════════════════════════════
 * Line processor — called for every complete line received from EC200U
 * ═══════════════════════════════════════════════════════════════════════════ */

static void process_line(const char *line)
{
    char dbg[80];

    /* ── always log non-empty lines to debug UART ── */
    if (line[0] && MODEM_TRACE_LINES)
    {
        snprintf(dbg, sizeof(dbg), "[EC200U] %s\r\n", line);
        Debug_Print(dbg);
    }

    /* Modem restarted unexpectedly (brownout/reset): all runtime MQTT/SSL
     * config is lost. Schedule a full Modem_Init() instead of partial retry.
     * Suppress during the 20s grace period after Modem_Init — late boot URCs
     * (APP RDY, +CFUN: 1) from the AT+CFUN=1,1 OTA reboot path must not
     * trigger a spurious re-init.                                            */
    if (!OTA_IsActive() &&
        modem_is_exact_reboot_urc(line) &&
        mqtt_state != MQTT_STATE_BOOT &&
        (int32_t)(HAL_GetTick() - modem_init_grace_until) >= 0)
    {
        modem_reinit_pending = true;
        Debug_Print("[MODEM] Unsolicited modem reboot detected\r\n");
    }

    /* Forward ALL lines to OTA state machine during an active OTA download.
     * OTA_HandleLine() handles HTTP/file URCs (+QHTTPGET, +QFOPEN, CONNECT).
     * Return early so MQTT logic doesn't misinterpret AT responses as MQTT. */
    if (OTA_IsActive())
    {
        OTA_HandleLine(line);
        return;
    }

    /* +QMTRECV: incoming command — handle in ANY state that has an active
     * MQTT session so relay commands work even during PUBLISHING/PUB_WAIT_OK.
     * Some EC200U firmware versions put the JSON payload on the SAME line:
     *   +QMTRECV: 0,0,"pump/01/cmd","{"relay1":1,"relay2":0}"
     * Others put it on the NEXT line (split format):
     *   +QMTRECV: 0,0,"pump/01/cmd",23
     *   {"relay1":1,"relay2":0}
     * The recv_payload_pending flag handles the split-line case.             */

    /* Case: payload arrived on line following +QMTRECV header */
    if (recv_payload_pending)
    {
        const char *json = strchr(line, '{');
        if (json)
        {
            recv_payload_pending = false;
            /* Settings topic */
            if (strstr(recv_pending_topic, TOPIC_SETTINGS))
            {
                apply_settings(json);
                recv_pending_topic[0] = '\0';
                return;
            }
            recv_pending_topic[0] = '\0';
            /* OTA command: {"url":"https://..."} */
            char ota_url[200];
            if (extract_str(json, "url", ota_url, sizeof(ota_url)))
            {
                if (ota_retry_blocked()) {
                    Debug_Print("[OTA] Ignored trigger (cooldown after reboot)\r\n");
                    return;
                }
                modem_ota_start(ota_url);
                return;
            }
            int r1 = extract_int(json, "relay1");
            int r2 = extract_int(json, "relay2");
            if (r1 >= 0)
            {
                if (r1 == 1 && HAL_GetTick() < lockout_until)
                    Debug_Print("[CMD] Relay1 ON blocked — lockout active\r\n");
                else
                {
                    Relay1_Set(r1 == 1);
                    Debug_Print(r1 ? "[CMD] Relay1 ON\r\n" : "[CMD] Relay1 OFF\r\n");
                }
            }
            if (r2 >= 0)
            {
                Relay2_Set(r2 == 1);
                Debug_Print(r2 ? "[CMD] Relay2 ON\r\n" : "[CMD] Relay2 OFF\r\n");
            }
            return;
        }
        /* Plain URL payload on next line (non-JSON bridge format). */
        {
            char ota_url[200];
            if (extract_ota_url_any(line, ota_url, sizeof(ota_url)))
            {
                recv_payload_pending = false;
                modem_ota_start(ota_url);
                return;
            }
        }
        /* "OK" ends an AT+QMTRECV exchange with no usable payload — clear flag */
        if (strcmp(line, "OK") == 0)
            recv_payload_pending = false;
        /* Other lines (e.g. +QMTRECV header) — keep waiting, fall through */
    }

    if (strstr(line, "+QMTRECV:"))
    {
        char *json = strchr(line, '{');
        if (json)
        {
            /* Settings topic inline: check topic in the +QMTRECV line */
            if (strstr(line, TOPIC_SETTINGS))
            {
                apply_settings(json);
                return;
            }
            /* OTA command: {"url":"https://..."} */
            char ota_url[200];
            if (extract_str(json, "url", ota_url, sizeof(ota_url)))
            {
                if (ota_retry_blocked()) {
                    Debug_Print("[OTA] Ignored trigger (cooldown after reboot)\r\n");
                    return;
                }
                modem_ota_start(ota_url);
                return;
            }
            /* Inline payload (single-line format) */
            int r1 = extract_int(json, "relay1");
            int r2 = extract_int(json, "relay2");
            if (r1 >= 0)
            {
                if (r1 == 1 && HAL_GetTick() < lockout_until)
                    Debug_Print("[CMD] Relay1 ON blocked — lockout active\r\n");
                else
                {
                    Relay1_Set(r1 == 1);
                    Debug_Print(r1 ? "[CMD] Relay1 ON\r\n" : "[CMD] Relay1 OFF\r\n");
                }
            }
            if (r2 >= 0)
            {
                Relay2_Set(r2 == 1);
                Debug_Print(r2 ? "[CMD] Relay2 ON\r\n" : "[CMD] Relay2 OFF\r\n");
            }
        }
        else
        {
            /* Inline non-JSON payload with URL in the same +QMTRECV line. */
            char ota_url[200];
            if (extract_ota_url_any(line, ota_url, sizeof(ota_url)))
            {
                modem_ota_start(ota_url);
                return;
            }
        }
        if (strchr(line, '"'))
        {
            /* Has quoted topic but no '{': response header from AT+QMTRECV.
             * Payload arrives on the next line — store topic for dispatch.  */
            recv_payload_pending = true;
            /* Extract topic name from: +QMTRECV: 0,0,"pump/01/settings",N  */
            const char *tq = strchr(line, '"');
            if (tq)
            {
                tq++;
                size_t ti = 0;
                while (*tq && *tq != '"' && ti < sizeof(recv_pending_topic) - 1)
                    recv_pending_topic[ti++] = *tq++;
                recv_pending_topic[ti] = '\0';
            }
        }
        else
        {
            /* Buffer-mode notification: "+QMTRECV: 0,<id>" — no topic, no
             * payload.  EC200U has buffered the message; request it now.   */
            const char *p = strchr(line, ',');
            if (p)
            {
                int msgid = atoi(p + 1);
                char recv_cmd[32];
                snprintf(recv_cmd, sizeof(recv_cmd), "AT+QMTRECV=0,%d", msgid);
                modem_cmd(recv_cmd);
                recv_payload_pending = true;
                recv_pending_topic[0] = '\0'; /* topic unknown in buffer-mode */
            }
        }
        return;
    }

    /* +QMTSTAT: server closed the connection.
     * IGNORE in early states (NET_WAIT→SUBSCRIBING) — it is a stale URC from
     * a previous AT+QMTCLOSE that arrived late.  Only act when we have a live
     * MQTT session (CONNECTED / PUBLISHING / PUB_WAIT_OK).                   */
    if (strstr(line, "+QMTSTAT:"))
    {
        if (mqtt_state == MQTT_STATE_CONNECTED ||
            mqtt_state == MQTT_STATE_PUBLISHING ||
            mqtt_state == MQTT_STATE_PUB_WAIT_OK)
        {
            Debug_Print("[MQTT] Disconnected (QMTSTAT)\r\n");
            blink_n(7); /* 7 blinks = server dropped connection unexpectedly */
            pub_pending = false;
            recv_payload_pending = false;
            mqtt_state = MQTT_STATE_DISCONNECTED;
        }
        /* else: ignore — stale URC from previous QMTCLOSE */
        return;
    }

    /* +CSQ: <rssi>,<ber>  — signal quality response */
    if (strstr(line, "+CSQ:"))
    {
        int rssi = 99;
        const char *p = strchr(line, ':');
        if (p)
        {
            p++;
            while (*p == ' ')
                p++;
            rssi = atoi(p);
        }
        if (rssi < 0 || rssi > 31) rssi = 99; /* sanitize */
        last_rssi = (int8_t)rssi;
        return;
    }

    switch (mqtt_state)
    {

