Vimalananth/STM32-EC200-Firmware/src/modem.c
    /* ── waiting for EC200U ready after boot ──────────────────────────── */
    case MQTT_STATE_BOOT:
        if (strstr(line, "RDY") || strstr(line, "OK"))
        {
            mqtt_state = MQTT_STATE_NET_WAIT;
            state_entered_ms = HAL_GetTick();
            modem_cmd("ATE0"); /* echo off                  */
            HAL_Delay(200);
            modem_cmd("AT+CMEE=2"); /* verbose errors            */
            HAL_Delay(200);
            modem_cmd("AT+CGREG?"); /* GPRS / 3G registration    */
            HAL_Delay(200);
            modem_cmd("AT+CEREG?"); /* LTE / 4G registration     */
        }
        break;

    /* ── wait for network registration (GPRS or LTE) ─────────────────── */
    case MQTT_STATE_NET_WAIT:
        if (strstr(line, "+CGREG: 0,1") || strstr(line, "+CGREG: 0,5") ||
            strstr(line, "+CEREG: 0,1") || strstr(line, "+CEREG: 0,5"))
        {
            Debug_Print("[NET] Registered\r\n");
            mqtt_state = MQTT_STATE_PDP_OPEN;
            state_entered_ms = HAL_GetTick();
            qicsgp_sent      = false; /* Modem_Process sends QICSGP after buffer drains */
            qiact_retry_done = false; /* reset retry flag for fresh PDP_ACTIVATE attempt */
        }
        /* retry registration every 5s */
        if (HAL_GetTick() - state_entered_ms > 5000)
        {
            Debug_Print("[NET] Waiting for registration...\r\n");
            state_entered_ms = HAL_GetTick();
            modem_cmd("AT+CGREG?");
            HAL_Delay(80);
            modem_cmd("AT+CEREG?");
        }
        break;

    /* ── AT+QICSGP sent — wait for OK then trigger AT+QIACT=1 ────────── */
    case MQTT_STATE_PDP_OPEN:
        if (strstr(line, "OK") && qicsgp_sent)
        {
            Debug_Print("[NET] APN set — activating PDP...\r\n");
            mqtt_state = MQTT_STATE_PDP_ACTIVATE;
            state_entered_ms = HAL_GetTick();
            qiact_sent = false; /* Modem_Process sends QIACT after buffer drains */
        }
        if (strstr(line, "ERROR"))
        {
            Debug_Print("[NET] APN config error — retrying\r\n");
            mqtt_state = MQTT_STATE_NET_WAIT;
            state_entered_ms = HAL_GetTick();
            qicsgp_sent = false;
        }
        break;

    /* ── AT+QIACT=1 sent — wait for OK (up to 30 s) ──────────────────── */
    case MQTT_STATE_PDP_ACTIVATE:
        /* Guard with qiact_sent: stale "OK" from AT+QMTCLOSE / AT+QIDEACT
         * (sent during reconnect with blocking delays) must not be mistaken
         * for QIACT's OK.  SSL is already configured in Modem_Init.        */
        if (strstr(line, "OK") && qiact_sent)
        {
            Debug_Print("[NET] PDP active — opening broker\r\n");
            modem_cmd("AT+QIDNSCFG=1,\"8.8.8.8\",\"8.8.4.4\"");
            HAL_Delay(200);
            qiact_retry_done = false;
            mqtt_state = MQTT_STATE_BROKER_OPEN;
            state_entered_ms = HAL_GetTick();

            char open_cmd[128];
            snprintf(open_cmd, sizeof(open_cmd),
                     "AT+QMTOPEN=0,\"%s\",%s", BROKER_HOST, BROKER_PORT);
            modem_cmd(open_cmd);
        }
        if (strstr(line, "ERROR"))
        {
            if (!qiact_retry_done)
            {
                /* EC200U returns ERROR when AT+QIACT=1 is sent on an already-
                 * active context (e.g., after OTA reboot where QIDEACT in
                 * Modem_Init failed because HTTP was still closing).
                 * Force-deactivate and retry QIACT once before giving up.   */
                qiact_retry_done = true;
                Debug_Print("[NET] QIACT error — force QIDEACT and retry\r\n");
                modem_cmd("AT+QIDEACT=1");
                HAL_Delay(2000);
                HAL_IWDG_Refresh(&hiwdg);
                { uint8_t _c; while (HAL_UART_Receive(modem_uart, &_c, 1, 1) == HAL_OK) {} }
                qiact_sent = false;        /* Modem_Process will send QIACT=1 again */
                state_entered_ms = HAL_GetTick(); /* reset 30 s timeout           */
            }
            else
            {
                /* Retry also failed — give up and restart from NET_WAIT */
                qiact_retry_done = false;
                Debug_Print("[NET] PDP activate failed (retry exhausted) — restarting\r\n");
                mqtt_state = MQTT_STATE_NET_WAIT;
                state_entered_ms = HAL_GetTick();
            }
        }
        /* 30 s timeout — QIACT sometimes silently fails */
        if (HAL_GetTick() - state_entered_ms > 30000)
        {
            Debug_Print("[NET] PDP activate timeout — retrying\r\n");
            mqtt_state = MQTT_STATE_NET_WAIT;
            state_entered_ms = HAL_GetTick();
        }
        break;

    /* ── waiting for +QMTOPEN: 0,0 ───────────────────────────────────── */
    case MQTT_STATE_BROKER_OPEN:
        /* This EC200U firmware sends two lines for a successful open:
         *   +QMTOPEN: 0,"hostname",port  ← TLS handshake started (set flag)
         *   OK                            ← TLS complete, session ready → CONNECT
         * Older FW sends only: +QMTOPEN: 0,0  (also handled below).
         * Do NOT send AT+QMTCONN until the OK arrives — TLS is not done yet. */
        if (strstr(line, "+QMTOPEN: 0,\""))
        {
            /* TCP connected, TLS handshake in progress — NOT ready yet.
             * Stay in BROKER_OPEN and wait for +QMTOPEN: 0,0            */
            Debug_Print("[MQTT] QMTOPEN TLS in progress...\r\n");
            qmtopen_tls_seen = true;
        }
        else if (strcmp(line, "OK") == 0 && qmtopen_tls_seen)
        {
            /* Intermediate OK — TLS still completing. Stay and wait for
             * +QMTOPEN: 0,0 which is the definitive success URC.        */
            Debug_Print("[MQTT] QMTOPEN intermediate OK — awaiting 0,0\r\n");
        }
        else if (strstr(line, "+QMTOPEN: 0,0"))
        {
            /* Definitive success — TLS complete, session ready. */
            qmtopen_tls_seen = false;
            mqtt_state = MQTT_STATE_CONNECTING;
            state_entered_ms = HAL_GetTick();

