Vimalananth/STM32-EC200-Firmware/src/modem.c
    /* ── waiting for '>' publish prompt ──────────────────────────────── */
    case MQTT_STATE_PUBLISHING:
        /* handled byte-by-byte in Modem_Process for '>' character */
        if (strstr(line, "ERROR"))
        {
            /* ERROR here means QMTPUBEX was rejected — connection is dead */
            Debug_Print("[MQTT] Publish prompt error — reconnecting\r\n");
            pub_pending = false;
            mqtt_state = MQTT_STATE_DISCONNECTED;
        }
        break;

    /* ── waiting for +QMTPUBEX: 0,0,0 ───────────────────────────────── */
    case MQTT_STATE_PUB_WAIT_OK:
        if (strstr(line, "+QMTPUBEX: 0,0,"))  /* any result code */
        {
            pub_pending = false;
            mqtt_state = MQTT_STATE_CONNECTED;
        }
        /* Some FW only sends "OK" for QoS=0 without a +QMTPUBEX URC */
        else if (strcmp(line, "OK") == 0)
        {
            pub_pending = false;
            mqtt_state = MQTT_STATE_CONNECTED;
        }
        if (strstr(line, "ERROR"))
        {
            Debug_Print("[MQTT] Publish failed\r\n");
            pub_pending = false;
            mqtt_state = MQTT_STATE_CONNECTED;
        }
        break;

    /* ── disconnected — will reconnect in Modem_Process ─────────────── */
    /* ── disconnected — will reconnect in Modem_Process ─────────────── */
    case MQTT_STATE_DISCONNECTED:
        break;

    /* ── SSL config — responses handled inline in Modem_Init sequence ── */
    case MQTT_STATE_SSL_CFG:
        break;
    }
}

/* Last non-empty line seen by modem_sync_expect — used in error messages */
static char modem_last_resp[64];

/* ── Synchronous line reader — polls UART until a line containing `expected`
 * is received, or ERROR, or timeout.  Returns true on match.
 * Refreshes IWDG every 1 ms so the watchdog never fires during the wait.
 * Sets modem_last_resp to the last non-empty line received (or "timeout").  */
static bool modem_sync_expect(const char *expected, uint32_t timeout_ms)
{
    char     linebuf[64];
    int      lpos = 0;
    uint32_t t0   = HAL_GetTick();
    modem_last_resp[0] = '\0';
    while (HAL_GetTick() - t0 < timeout_ms) {
        HAL_IWDG_Refresh(&hiwdg);
        uint8_t c;
        if (HAL_UART_Receive(modem_uart, &c, 1, 1) != HAL_OK) continue;
        if (c == '\r') continue;
        if (c == '\n') {
            linebuf[lpos] = '\0';
            if (lpos > 0) {
                strncpy(modem_last_resp, linebuf, sizeof(modem_last_resp) - 1);
                modem_last_resp[sizeof(modem_last_resp) - 1] = '\0';
                if (strstr(linebuf, expected)) return true;
                if (strstr(linebuf, "ERROR"))  return false;
            }
            lpos = 0;
        } else if (lpos < (int)sizeof(linebuf) - 1) {
            linebuf[lpos++] = (char)c;
        }
    }
    strncpy(modem_last_resp, "timeout", sizeof(modem_last_resp) - 1);
    return false; /* timeout */
}

/* Send an AT command and wait for an OK response.
 * Retries are used in Modem_Init because EC200U can still be settling
 * for a short time after CFUN reset during post-OTA reboot. */
static bool modem_sync_cmd_ok(const char *cmd, uint32_t timeout_ms, uint8_t retries)
{
    for (uint8_t i = 0; i < retries; i++) {
        modem_cmd(cmd);
        if (modem_sync_expect("OK", timeout_ms))
            return true;
        HAL_Delay(300);
        HAL_IWDG_Refresh(&hiwdg);
    }
    return false;
}

static bool modem_is_exact_reboot_urc(const char *line)
{
    if (!line || !line[0]) return false;
    if (strcmp(line, "RDY") == 0) return true;
    if (strcmp(line, "+CFUN: 1") == 0) return true;
    return false;
}

static bool modem_extract_host(const char *url, char *host, size_t host_sz)
{
    const char *p = strstr(url, "://");
    const char *start = p ? (p + 3) : url;
    size_t i = 0;
    if (!host || host_sz < 2 || !start || *start == '\0')
        return false;
    while (start[i] &&
           start[i] != '/' &&
           start[i] != ':' &&
           start[i] != '?' &&
           start[i] != '#' &&
           i < (host_sz - 1U))
    {
        host[i] = start[i];
        i++;
    }
    host[i] = '\0';
    return i > 0;
}

/* ── OTA trigger helper — re-applies HTTP config before each download ────── */
static void modem_ota_start(const char *url)
{
    char ota_host[96] = {0};
    bool have_ota_host = modem_extract_host(url, ota_host, sizeof(ota_host));
    /* Central cooldown guard: block OTA retrigger after modem reboot during OTA. */
    if (ota_retry_blocked()) {
        Debug_Print("[OTA] Trigger ignored (cooldown active)\r\n");
        queue_publish("pump/01/ota/status",
                      "{\"ota_status\":\"error\",\"reason\":\"ota cooldown active\"}");
        return;
    }
    if (ota_error_msg[0] != '\0') {
        Debug_Print("[OTA] Trigger ignored while OTA result publish is pending\r\n");
        return;
    }

    /* ── PHASE 1: everything done while MQTT is still connected ──────────────
     *
     * Key insight: AT+QHTTPURL only stores the URL in RAM — it does NOT start
     * a TLS handshake or any network activity.  The TLS/TCP connection only
     * happens later during AT+QHTTPGET.
     *
     * By doing SSL config, QHTTPCFG, and QHTTPURL while MQTT is connected, any
     * failure (ERROR / timeout) can be published to Firebase immediately via the
     * live MQTT connection — no reconnect cycle needed.
     *
     * AT+QHTTPGET is the only command that cannot coexist with MQTT TLS
     * (EC200U cannot run two simultaneous TLS sessions), so MQTT disconnect
     * is deferred until just before AT+QHTTPGET.                            */

    /* Publish "starting" — tells bridge.js to clear the retained OTA message
     * on pump/01/ota so the board doesn't re-trigger OTA on every reconnect. */
    /* Publish "starting" even if a status heartbeat is mid-flight.
     * The retained pump/01/ota message often arrives while mqtt_state is
     * PUBLISHING or PUB_WAIT_OK (connection heartbeat queued immediately on
     * CONNECTED).  Wait 700 ms for the in-progress publish to complete, then
     * flush stale modem bytes before sending our own AT+QMTPUBEX.            */
    if (mqtt_state == MQTT_STATE_CONNECTED  ||
        mqtt_state == MQTT_STATE_PUBLISHING ||
        mqtt_state == MQTT_STATE_PUB_WAIT_OK) {
        HAL_Delay(700);                        /* let previous publish finish */
        HAL_IWDG_Refresh(&hiwdg);
        { uint8_t _c; while (HAL_UART_Receive(modem_uart, &_c, 1, 50) == HAL_OK) {} }

        const char *ota_payload = "{\"ota_status\":\"starting\"}";
        char pub_cmd[80];
        snprintf(pub_cmd, sizeof(pub_cmd),
                 "AT+QMTPUBEX=0,0,0,0,\"pump/01/ota/status\",%d",
                 (int)strlen(ota_payload));
        modem_cmd(pub_cmd);
        uint8_t c;
        uint32_t t0 = HAL_GetTick();
        bool got_prompt = false;
        while (HAL_GetTick() - t0 < 3000) {
            if (HAL_UART_Receive(modem_uart, &c, 1, 5) == HAL_OK && c == '>') {
                got_prompt = true; break;
            }
        }
        if (got_prompt) {
            HAL_UART_Transmit(modem_uart, (uint8_t*)ota_payload,
                              strlen(ota_payload), 1000);
            uint8_t ctrlz = 0x1A;  /* Ctrl-Z commits the MQTT publish */
            HAL_UART_Transmit(modem_uart, &ctrlz, 1, 1000);
            HAL_Delay(500);        /* wait for modem to process publish */
            /* Flush +QMTPUBEX response so it doesn't interfere with SSL cmds */
            { uint8_t _c; while (HAL_UART_Receive(modem_uart, &_c, 1, 50) == HAL_OK) {} }
        }
        HAL_IWDG_Refresh(&hiwdg);
    }

