Vimalananth/STM32-EC200-Firmware/src/modem.c
    /* SSL context 1 — used by HTTP client (independent of context 0 = MQTT).
     * Re-applied here because AT+QIDEACT (from a previous reconnect) resets
     * QSSLCFG RAM settings.                                                 */
    modem_cmd("AT+QSSLCFG=\"sslversion\",1,4");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QSSLCFG=\"ciphersuite\",1,0xFFFF");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QSSLCFG=\"seclevel\",1,0");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    /* EC200U HTTPS servers behind CDN (e.g., GitHub raw) typically require
     * TLS SNI and can reject handshake when modem RTC is stale. */
    if (have_ota_host) {
        char sni_cmd[160];
        snprintf(sni_cmd, sizeof(sni_cmd), "AT+QSSLCFG=\"sni\",1,\"%s\"", ota_host);
        modem_cmd(sni_cmd);
    } else {
        modem_cmd("AT+QSSLCFG=\"sni\",1,1");
    }
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QSSLCFG=\"ignorelocaltime\",1,1");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QHTTPCFG=\"contextid\",1");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QHTTPCFG=\"sslctxid\",1");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    /* Without "ssl",1 the HTTP client uses plain TCP even for https:// URLs.
     * The TLS handshake never happens and GitHub returns a connection error. */
    modem_cmd("AT+QHTTPCFG=\"ssl\",1");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd(OTA_HTTP_REDIRECT_ENABLED ? "AT+QHTTPCFG=\"redirect\",1"
                                        : "AT+QHTTPCFG=\"redirect\",0");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QHTTPCFG=\"responseheader\",0");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QHTTPCFG=\"requestheader\",0");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);

    /* Stop any lingering HTTP session and delete any leftover file from a
     * previous failed OTA attempt.  AT+QHTTPGET auto-saves the response to
     * "HTTP_GETFILE" on EC200U UFS (no drive prefix).  Delete it first so
     * stale content cannot be flashed if a previous download was incomplete.
     * Errors from both commands are ignored. */
    modem_cmd("AT+QHTTPSTOP");
    HAL_Delay(500);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QFDEL=\"HTTP_GETFILE\"");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);
    { uint8_t _c; while (HAL_UART_Receive(modem_uart, &_c, 1, 50) == HAL_OK) {} }
    HAL_IWDG_Refresh(&hiwdg);

    /* Set URL.  Use a 5-second input window so the modem exits URL-input mode
     * before modem_sync_expect (10 s) returns — keeps the modem in a clean
     * command-mode state on failure.                                         */
    char urlcmd[32];
    snprintf(urlcmd, sizeof(urlcmd), "AT+QHTTPURL=%d,5", (int)strlen(url));
    modem_cmd(urlcmd);

    if (!modem_sync_expect("CONNECT", 10000)) {
        /* URL setup failed — MQTT is still connected.  Publish error directly
         * via queue_publish so it appears in Firebase within seconds.
         * No reconnect needed; just return and let the main loop resume.    */
        char errbuf[80];
        snprintf(errbuf, sizeof(errbuf),
                 "{\"ota_status\":\"error\",\"reason\":\"no CONNECT: %s\"}", modem_last_resp);
        pub_pending = false;
        queue_publish("pump/01/ota/status", errbuf);
        return;   /* MQTT still connected — normal operation resumes         */
    }

    /* Send URL bytes (no \r\n — modem counts exact bytes) */
    Modem_Send(url);
    HAL_IWDG_Refresh(&hiwdg);

    if (!modem_sync_expect("OK", 10000)) {
        char errbuf[80];
        snprintf(errbuf, sizeof(errbuf),
                 "{\"ota_status\":\"error\",\"reason\":\"URL rejected: %s\"}", modem_last_resp);
        pub_pending = false;
        queue_publish("pump/01/ota/status", errbuf);
        return;   /* MQTT still connected                                    */
    }
    HAL_IWDG_Refresh(&hiwdg);

    /* ── PHASE 2: disconnect MQTT, full modem reset, restart download ───────
     *
     * Problem: AT+QFOPEN is silently ignored after a previous failed QFOPEN
     * attempt.  The EC200U's UFS file system mutex gets stuck and the only
     * command that clears it is AT+CFUN=1,1 (full modem software reset).
     * QIDEACT+QIACT frees TLS RAM (fixes 729) but does NOT clear the FS
     * mutex.  CFUN=1,1 fixes both.
     *
     * Since CFUN=1,1 wipes all modem config (SSL, HTTP, URL), we call
     * OTA_Start() instead of OTA_StartFromGet() so the state machine
     * re-applies SSL context and URL from scratch on the clean modem.      */
    modem_cmd("AT+QMTDISC=0");
    HAL_Delay(500);
    HAL_IWDG_Refresh(&hiwdg);
    modem_cmd("AT+QMTCLOSE=0");
    HAL_Delay(300);
    HAL_IWDG_Refresh(&hiwdg);

    Debug_Print("[OTA] CFUN=1,1 — full modem reset to clear UFS/TLS state\r\n");
    modem_cmd("AT+CFUN=1,1");
    modem_sync_expect("RDY", 30000);          /* wait up to 30 s for modem  */
    IWDG->KR = 0xAAAAU;
    for (int _i = 0; _i < 30; _i++) {        /* 15 s: SIM CPIN + network   */
        HAL_Delay(500); IWDG->KR = 0xAAAAU;
    }
    { uint8_t _c; while (HAL_UART_Receive(modem_uart, &_c, 1, 200) == HAL_OK) {} }
    IWDG->KR = 0xAAAAU;

    modem_sync_cmd_ok("ATE0", 2000, 5);       /* disable echo after reset   */

    /* Reactivate PDP context — retry up to 3× in case network not ready   */
    for (int _a = 0; _a < 3; _a++) {
        modem_cmd("AT+QIACT=1");
        if (modem_sync_expect("OK", 15000)) break;
        for (int _i = 0; _i < 6; _i++) {     /* 3 s between retries        */
            HAL_Delay(500); IWDG->KR = 0xAAAAU;
        }
    }
    modem_sync_cmd_ok("AT+QIDNSCFG=1,\"8.8.8.8\",\"8.8.4.4\"", 3000, 2);
    HAL_IWDG_Refresh(&hiwdg);

    /* Re-sync parser and configure HTTP/TLS synchronously after CFUN reset.
     * This avoids async SSL state races right after reboot. */
    if (!modem_sync_cmd_ok("AT", 2000, 8))
        Debug_Print("[OTA] WARN: AT sync before OTA HTTP cfg failed\r\n");
    modem_sync_cmd_ok("ATE0", 2000, 3);
    HAL_Delay(300); IWDG->KR = 0xAAAAU;

    modem_sync_cmd_ok("AT+QSSLCFG=\"sslversion\",1,4", 3000, 3);
    modem_sync_cmd_ok("AT+QSSLCFG=\"ciphersuite\",1,0xFFFF", 3000, 3);
    modem_sync_cmd_ok("AT+QSSLCFG=\"seclevel\",1,0", 3000, 3);
    if (have_ota_host) {
        char sni_cmd2[160];
        snprintf(sni_cmd2, sizeof(sni_cmd2), "AT+QSSLCFG=\"sni\",1,\"%s\"", ota_host);
        modem_sync_cmd_ok(sni_cmd2, 3000, 3);
    } else {
        modem_sync_cmd_ok("AT+QSSLCFG=\"sni\",1,1", 3000, 3);
    }
    modem_sync_cmd_ok("AT+QSSLCFG=\"ignorelocaltime\",1,1", 3000, 3);
    modem_sync_cmd_ok("AT+QHTTPCFG=\"contextid\",1", 3000, 3);
    modem_sync_cmd_ok("AT+QHTTPCFG=\"sslctxid\",1", 3000, 3);
    modem_sync_cmd_ok("AT+QHTTPCFG=\"ssl\",1", 3000, 3);
    modem_sync_cmd_ok(OTA_HTTP_REDIRECT_ENABLED ? "AT+QHTTPCFG=\"redirect\",1"
                                                : "AT+QHTTPCFG=\"redirect\",0",
                     3000, 3);
    modem_sync_cmd_ok("AT+QHTTPCFG=\"responseheader\",0", 3000, 3);
    modem_sync_cmd_ok("AT+QHTTPCFG=\"requestheader\",0", 3000, 3);
    modem_sync_cmd_ok("AT+QHTTPSTOP", 3000, 2);
    modem_cmd("AT+QFDEL=\"HTTP_GETFILE\"");  /* may fail if file absent */
    HAL_Delay(300); IWDG->KR = 0xAAAAU;
    { uint8_t _c; while (HAL_UART_Receive(modem_uart, &_c, 1, 100) == HAL_OK) {} }

    /* Set URL synchronously, then jump OTA state machine to QHTTPGET. */
    {
        char urlcmd2[32];
        snprintf(urlcmd2, sizeof(urlcmd2), "AT+QHTTPURL=%d,5", (int)strlen(url));
        modem_cmd(urlcmd2);
        if (!modem_sync_expect("CONNECT", 10000)) {
            queue_publish("pump/01/ota/status",
                          "{\"ota_status\":\"error\",\"reason\":\"no CONNECT (post-cfun)\"}");
            return;
        }
        Modem_Send(url);
        if (!modem_sync_expect("OK", 10000)) {
            queue_publish("pump/01/ota/status",
                          "{\"ota_status\":\"error\",\"reason\":\"URL reject (post-cfun)\"}");
            return;
        }
    }

    mqtt_state = MQTT_STATE_DISCONNECTED;
    HAL_IWDG_Refresh(&hiwdg);

