Vimalananth/STM32-EC200-Firmware/src/modem.c
    /* ── auto-reconnect (not during OTA — would disrupt HTTP download) ── */
    if (mqtt_state == MQTT_STATE_DISCONNECTED && !OTA_IsActive())
    {
        static uint32_t last_reconnect = 0;
        if (HAL_GetTick() - last_reconnect > 10000)
        {
            last_reconnect = HAL_GetTick();
            state_entered_ms = HAL_GetTick();
            /* Refresh IWDG immediately — blink_n(5/6/7) may have consumed up to
             * 3800ms before setting DISCONNECTED, leaving < 200ms until timeout. */
            HAL_IWDG_Refresh(&hiwdg);
            qmtopen_tls_seen = false;
            Debug_Print("[MQTT] Reconnecting...\r\n");
            /* Stop any active HTTP session BEFORE closing MQTT and deactivating
             * the PDP bearer.  After a failed OTA, the HTTP context may still be
             * "open" (QHTTPCFG configured, partial QHTTPURL).  AT+QIDEACT fails
             * silently when an HTTP session is active, leaving the PDP in a bad
             * state and preventing MQTT from ever reconnecting.
             * Modem_Init already does this; we must mirror it here.            */
            modem_cmd("AT+QHTTPSTOP");
            HAL_Delay(500);
            HAL_IWDG_Refresh(&hiwdg);
            modem_cmd("AT+QMTCLOSE=0");
            HAL_Delay(1500);
            HAL_IWDG_Refresh(&hiwdg);
            /* Flush URCs from QMTCLOSE (TCP teardown can take several seconds).
             * Refresh IWDG every 500 ms so a chatty modem can't trigger a reset. */
            {
                uint8_t _c; uint32_t _t = HAL_GetTick();
                while (HAL_UART_Receive(modem_uart, &_c, 1, 1) == HAL_OK) {
                    if (HAL_GetTick() - _t >= 500) { HAL_IWDG_Refresh(&hiwdg); _t = HAL_GetTick(); }
                }
                rxpos = 0;
            }
            /* Re-apply after QMTCLOSE — QMTCLOSE reloads NVM which resets version
             * to default=3 (MQTT 3.1) which strips credentials from CONNECT.  */
            modem_cmd("AT+QMTCFG=\"version\",0,4");  /* keep MQTT 3.1.1        */
            HAL_Delay(300);
            modem_cmd("AT+QMTCFG=\"will\",0,0");
            HAL_Delay(300);
            /* QMTCLOSE reloads NVM which resets ssl to factory default (0=disabled).
             * Without this, QMTOPEN uses plain TCP on port 8883 (TLS expected) and
             * fails silently every reconnect cycle — confirmed root cause of
             * post-OTA MQTT never connecting.                                   */
            modem_cmd("AT+QMTCFG=\"ssl\",0,1,0"); /* MQTT ctx 0 → SSL ctx 0    */
            HAL_Delay(300);
            HAL_IWDG_Refresh(&hiwdg);
            modem_cmd("AT+QIDEACT=1");
            HAL_Delay(1500);
            HAL_IWDG_Refresh(&hiwdg);
            /* Flush URCs from QIDEACT (PDP deactivation URCs may arrive late). */
            {
                uint8_t _c; uint32_t _t = HAL_GetTick();
                while (HAL_UART_Receive(modem_uart, &_c, 1, 1) == HAL_OK) {
                    if (HAL_GetTick() - _t >= 500) { HAL_IWDG_Refresh(&hiwdg); _t = HAL_GetTick(); }
                }
                rxpos = 0;
            }
            recv_payload_pending = false; /* clear stale recv state           */
            pub_pending          = false; /* drop unsent publish              */
            /* Re-apply SSL context 0 after QMTCLOSE — NVM reload may have
             * reset seclevel/ciphersuite/SNI back to factory defaults,
             * causing TLS handshake to fail when QMTOPEN is sent.          */
            modem_cmd("AT+QSSLCFG=\"sslversion\",0,4");
            HAL_Delay(300);
            HAL_IWDG_Refresh(&hiwdg);
            modem_cmd("AT+QSSLCFG=\"ciphersuite\",0,0xFFFF");
            HAL_Delay(300);
            HAL_IWDG_Refresh(&hiwdg);
            modem_cmd("AT+QSSLCFG=\"seclevel\",0,0");
            HAL_Delay(300);
            HAL_IWDG_Refresh(&hiwdg);
            modem_cmd("AT+QSSLCFG=\"sni\",0,\"" BROKER_HOST "\"");
            HAL_Delay(300);
            HAL_IWDG_Refresh(&hiwdg);
            /* APN already configured — skip QICSGP, go straight to QIACT.
             * Modem_Process sends AT+QIACT=1 after the buffer is drained
             * so stale OK from QMTCLOSE/QIDEACT above is not misread.      */
            mqtt_state       = MQTT_STATE_PDP_ACTIVATE;
            qiact_sent       = false;
            qiact_retry_done = false; /* fresh attempt — PDP just deactivated */
        }
    }

    /* ── net registration timeout — retry both GPRS and LTE ── */
    if (mqtt_state == MQTT_STATE_NET_WAIT &&
        HAL_GetTick() - state_entered_ms > 5000)
    {
        state_entered_ms = HAL_GetTick();
        modem_cmd("AT+CGREG?");
        HAL_Delay(200);
        modem_cmd("AT+CEREG?");
    }
}


